; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v6 ?v3)
             (pred_1 ?v8 ?v7)
             (pred_9 ?v6 ?v7)
             (pred_11 ?v2 ?v6 )
	     (pred_7 ?v6)
             (pred_10 ?v9)
             (pred_4 ?v8)
             (pred_8 ?v7)
             (pred_3 ?v6)
             (pred_12 ?v8)
             (pred_6 ?v6)
             (pred_5 ))



(:action op_2
:parameters (?v10 ?v12 ?v5 ?v11)
:precondition (and (pred_10 ?v10) (pred_10 ?v12) (pred_4 ?v5) (pred_8 ?v11)
          (pred_2 ?v10 ?v12) (pred_1 ?v5 ?v11)
                   (pred_9 ?v12 ?v11) (pred_7 ?v10) 
                   (pred_3 ?v12) (pred_12 ?v5))
:effect (and  (pred_6 ?v12) (not (pred_3 ?v12))))


(:action op_1
:parameters (?v10 ?v4)
:precondition (and (pred_10 ?v10) (pred_10 ?v4)
               (pred_7 ?v10) (pred_2 ?v10 ?v4) (pred_6 ?v4))
:effect (and (pred_7 ?v4) (not (pred_7 ?v10))))

(:action op_5
:parameters (?v10 ?v5)
:precondition (and (pred_10 ?v10) (pred_4 ?v5) 
                  (pred_7 ?v10) (pred_11 ?v5 ?v10) (pred_5 ))
:effect (and (pred_12 ?v5)
   (not (pred_11 ?v5 ?v10)) (not (pred_5 ))))


(:action op_4
:parameters (?v10 ?v13 ?v1)
:precondition (and (pred_10 ?v10) (pred_4 ?v13) (pred_4 ?v1)
                  (pred_7 ?v10) (pred_12 ?v1) (pred_11 ?v13 ?v10))
:effect (and (pred_12 ?v13) (pred_11 ?v1 ?v10)
        (not (pred_12 ?v1)) (not (pred_11 ?v13 ?v10))))

(:action op_3
:parameters (?v10 ?v5)
:precondition (and (pred_10 ?v10) (pred_4 ?v5) 
                  (pred_7 ?v10) (pred_12 ?v5))
:effect (and (pred_5 ) (pred_11 ?v5 ?v10) (not (pred_12 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_16 obj_11 obj_24 obj_02 obj_08 obj_29 obj_12 obj_17 obj_31 obj_13 obj_20 obj_01 obj_04 obj_03 obj_15 obj_26 obj_22 obj_19 obj_14 obj_10 obj_28 obj_21 obj_18 obj_06
    obj_25 obj_09 obj_07
    obj_27 obj_30 obj_05
    )

    (:init
       (pred_5)

       (pred_10 obj_23)
       (pred_10 obj_16)
       (pred_10 obj_11)
       (pred_10 obj_24)
       (pred_10 obj_02)
       (pred_10 obj_08)
       (pred_10 obj_29)
       (pred_10 obj_12)
       (pred_10 obj_17)
       (pred_10 obj_31)
       (pred_10 obj_13)
       (pred_10 obj_20)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_03)
       (pred_10 obj_15)
       (pred_10 obj_26)
       (pred_10 obj_22)
       (pred_10 obj_19)
       (pred_10 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_28)
       (pred_10 obj_21)
       (pred_10 obj_18)
       (pred_10 obj_06)
       (pred_8 obj_25)
       (pred_8 obj_09)
       (pred_8 obj_07)
       (pred_4 obj_27)
       (pred_4 obj_30)
       (pred_4 obj_05)

       (pred_2 obj_23 obj_08)
       (pred_2 obj_23 obj_16)
       (pred_2 obj_16 obj_29)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_16 obj_23)
       (pred_2 obj_11 obj_12)
       (pred_2 obj_11 obj_24)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_24 obj_17)
       (pred_2 obj_24 obj_02)
       (pred_2 obj_24 obj_11)
       (pred_2 obj_02 obj_31)
       (pred_2 obj_02 obj_24)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_08 obj_29)
       (pred_2 obj_08 obj_23)
       (pred_2 obj_29 obj_20)
       (pred_2 obj_29 obj_12)
       (pred_2 obj_29 obj_16)
       (pred_2 obj_29 obj_08)
       (pred_2 obj_12 obj_01)
       (pred_2 obj_12 obj_17)
       (pred_2 obj_12 obj_11)
       (pred_2 obj_12 obj_29)
       (pred_2 obj_17 obj_04)
       (pred_2 obj_17 obj_31)
       (pred_2 obj_17 obj_24)
       (pred_2 obj_17 obj_12)
       (pred_2 obj_31 obj_03)
       (pred_2 obj_31 obj_02)
       (pred_2 obj_31 obj_17)
       (pred_2 obj_13 obj_15)
       (pred_2 obj_13 obj_20)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_20 obj_26)
       (pred_2 obj_20 obj_01)
       (pred_2 obj_20 obj_29)
       (pred_2 obj_20 obj_13)
       (pred_2 obj_01 obj_22)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_01 obj_12)
       (pred_2 obj_01 obj_20)
       (pred_2 obj_04 obj_19)
       (pred_2 obj_04 obj_03)
       (pred_2 obj_04 obj_17)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_03 obj_14)
       (pred_2 obj_03 obj_31)
       (pred_2 obj_03 obj_04)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_15 obj_26)
       (pred_2 obj_15 obj_13)
       (pred_2 obj_26 obj_28)
       (pred_2 obj_26 obj_22)
       (pred_2 obj_26 obj_20)
       (pred_2 obj_26 obj_15)
       (pred_2 obj_22 obj_21)
       (pred_2 obj_22 obj_19)
       (pred_2 obj_22 obj_01)
       (pred_2 obj_22 obj_26)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_19 obj_14)
       (pred_2 obj_19 obj_04)
       (pred_2 obj_19 obj_22)
       (pred_2 obj_14 obj_06)
       (pred_2 obj_14 obj_03)
       (pred_2 obj_14 obj_19)
       (pred_2 obj_10 obj_28)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_28 obj_21)
       (pred_2 obj_28 obj_26)
       (pred_2 obj_28 obj_10)
       (pred_2 obj_21 obj_18)
       (pred_2 obj_21 obj_22)
       (pred_2 obj_21 obj_28)
       (pred_2 obj_18 obj_06)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_21)
       (pred_2 obj_06 obj_14)
       (pred_2 obj_06 obj_18)
       (pred_3 obj_18)
       (pred_3 obj_06)
       (pred_3 obj_22)
       (pred_9  obj_18 obj_25)
       (pred_9  obj_06 obj_09)
       (pred_9  obj_22 obj_07)
       (pred_6 obj_23)
       (pred_6 obj_16)
       (pred_6 obj_11)
       (pred_6 obj_24)
       (pred_6 obj_02)
       (pred_6 obj_08)
       (pred_6 obj_29)
       (pred_6 obj_12)
       (pred_6 obj_17)
       (pred_6 obj_31)
       (pred_6 obj_13)
       (pred_6 obj_20)
       (pred_6 obj_01)
       (pred_6 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_15)
       (pred_6 obj_26)
       (pred_6 obj_19)
       (pred_6 obj_14)
       (pred_6 obj_10)
       (pred_6 obj_28)
       (pred_6 obj_21)

       (pred_1  obj_27 obj_25)
       (pred_1  obj_30 obj_09)
       (pred_1  obj_05 obj_07)
       (pred_11 obj_27 obj_01)
       (pred_11 obj_30 obj_20)
       (pred_11 obj_05 obj_23)
       (pred_7 obj_02)
    )

    (:goal (and
       (pred_11 obj_30 obj_26)
    ))
(:constraints
  (always (not (pred_7 obj_29)))
)
)

; plan
1. (op_1 obj_02 obj_24)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_24)
   goals met: 0 of 1
2. (op_1 obj_24 obj_11)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_11)
   goals met: 0 of 1
3. (op_1 obj_11 obj_12)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_12)
   goals met: 0 of 1
4. (op_1 obj_12 obj_01)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_01)
   goals met: 0 of 1
5. (op_1 obj_01 obj_20)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_20)
   goals met: 0 of 1
6. (op_5 obj_20 obj_30)
   deleted: (pred_11 obj_30 obj_20) (pred_5)
   added: (pred_12 obj_30)
   goals met: 0 of 1
7. (op_1 obj_20 obj_26)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_26)
   goals met: 0 of 1
8. (op_3 obj_26 obj_30)
   deleted: (pred_12 obj_30)
   added: (pred_5) (pred_11 obj_30 obj_26)
   goals met: 1 of 1
